//──────────────────────────────────────────────────────────────────────────
// ファイル名	：LinePack.cs
// 概要			：LineCreaterから曲線情報を外に出すためのクラス
// 作成者		：杉山 雅哉
// 作成日		：2018/04/16
// 
//──────────────────────────────────────────────────────────────────────────
// 更新履歴：
// 2019/04/16 [杉山 雅哉] クラス作成。必要なプロパティを宣言
// TODO：
//
//──────────────────────────────────────────────────────────────────────────
using UnityEngine;

public class LinePack
{
	//プロパティ───────────────────────────────────────
	public Vector3[] positions;
	public float interval;
	public float length;
	public float overallLength;
	//────────────────────────────────────────────
}
